/*
 * Test for multiboot
 *
 */
#include "libcflat.h"
#include "desc.h"
#include "processor.h"
#include "alloc.h"
#include "alloc_phys.h"
#include "vmalloc.h"
#include "alloc_page.h"
#include "asm/io.h"
#include "asm/spinlock.h"
#include "debug_print.h"
#include "multiboot.h"
#include "misc.h"
#include "fwcfg.h"
#include "delay.h"


/** Defines a single entry in an E820 memory map. */
struct e820_entry {
	/** The base address of the memory range. */
	uint64_t baseaddr;
	/** The length of the memory range. */
	uint64_t length;
	/** The type of memory region. */
	uint32_t type;
}  __attribute__((packed));

/* The real mode kernel header, refer to Documentation/x86/boot.txt */
struct _zeropage {
	uint8_t pad1[0x1e8];                    /* 0x000 */
	uint8_t e820_nentries;                  /* 0x1e8 */
	uint8_t pad2[0x8];                      /* 0x1e9 */
	union {
		struct	{
			uint8_t hdr_pad1[0x1f];         /* 0x1f1 */
			uint8_t loader_type;            /* 0x210 */
			uint8_t load_flags;             /* 0x211 */
			uint8_t hdr_pad2[0x2];          /* 0x212 */
			uint32_t code32_start;          /* 0x214 */
			uint32_t ramdisk_addr;          /* 0x218 */
			uint32_t ramdisk_size;          /* 0x21c */
			uint8_t hdr_pad3[0x8];          /* 0x220 */
			uint32_t bootargs_addr;         /* 0x228 */
			uint8_t hdr_pad4[0x3c];         /* 0x22c */
		} __attribute__((packed)) hdr;

		struct {
			uint8_t setup_sects; /* 0x1f1 */
			uint8_t hdr_pad1[0x14]; /* 0x1f2 */
			uint16_t version;	/* 0x206 */
			uint8_t hdr_pad8[0x8]; /* 0x208 */
			uint8_t loader_type; /* 0x210 */
			uint8_t load_flags; /* 0x211 */
			uint8_t hdr_pad2[0x6]; /* 0x212 */
			uint32_t ramdisk_addr; /* 0x218 */
			uint32_t ramdisk_size; /* 0x21c */
			uint8_t hdr_pad3[0x8]; /* 0x220 */
			uint32_t bootargs_addr; /* 0x228 */
			uint8_t hdr_pad4[0x8]; /* 0x22c */
			uint8_t relocatable_kernel; /* 0x234 */
			uint8_t hdr_pad5[0x13]; /* 0x235 */
			uint32_t payload_offset; /* 0x248 */
			uint32_t payload_length; /* 0x24c */
			uint8_t hdr_pad6[0x8]; /* 0x250 */
			uint64_t pref_addr; /* 0x258 */
			uint8_t hdr_pad7[8]; /* 0x260 */
		} __packed hdr1;
	};

	uint8_t pad3[0x68];                     /* 0x268 */
	struct e820_entry e820[0x80];           /* 0x2d0 */
	uint8_t pad4[0x330];                    /* 0xcd0 */
} __attribute__((packed));

struct acpi_table_rsdp {
	/* ACPI signature, contains "RSD PTR " */
	char signature[RSDP_SIGNATURE_LEN];
	/* ACPI 1.0 checksum */
	uint8_t checksum;
	/* OEM identification */
	char oem_id[ACPI_OEM_ID_SIZE];
	/* Must be (0) for ACPI 1.0 or (2) for ACPI 2.0+ */
	uint8_t revision;
	/* 32-bit physical address of the RSDT */
	uint32_t rsdt_physical_address;
	/* Table length in bytes, including header (ACPI 2.0+) */
	uint32_t length;
	/* 64-bit physical address of the XSDT (ACPI 2.0+) */
	uint64_t xsdt_physical_address;
	/* Checksum of entire table (ACPI 2.0+) */
	uint8_t extended_checksum;
	/* Reserved, must be zero */
	uint8_t reserved[3];
} __attribute__((packed));

struct acpi_table_header {
	/* ASCII table signature */
	char signature[4];
	/* Length of table in bytes, including this header */
	uint32_t length;
	/* ACPI Specification minor version number */
	uint8_t revision;
